vuln_dict = {
    "buffer_overflow": "1. Переполнение буфера",
    "format_string_error": "2. Ошибка форматной строки",
    "sql_injection": "3. Внедрение SQL-кода",
    "command_intrusion": "4. Внедрение команд",
    "unsafe_data_storage": "5. Пренебрежение безопасным хранением данных",
    "memory_leak": "6. Утечка памяти",
    "bad_file_access": "7. Некорректный доступ к файлу",
    "null_pointer_derefence": "8. Разыменование нулевого указателя",
    "number_overflow": "9. Переполнение целых чисел",
    "race_condition": "10. Некорректная синхронизация типа гонки",
    "incorr_rw_sync": "11. Некорректная синхронизация типа читатели-писатели",
    "uninit_var": "12. Неинициализированная переменная",
}